ankuns/nrfx/bsp/stable/mdk/nrf7140_application_peripherals.h
/*CM33 SubSystem*/
#define CM33SS_PRESENT 1
#define CM33SS_COUNT 1

#define CPUC_FPUAVAILABLE 1                          /*!< (unspecified)                                                        */

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

#define MVDMA_PRESENT 1
#define MVDMA_COUNT 3

#define MVDMA_COMPLETED_EVENT 1                      /*!< (unspecified)                                                        */
#define MVDMA_DPPI_DISCONNECTED 0                    /*!< (unspecified)                                                        */
#define MVDMA_INSTANCE_IN_WRAPPER 0                  /*!< (unspecified)                                                        */

#define MVDMA120_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA120_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA120_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */

#define MVDMA121_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA121_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA121_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 3

#define RAMC_ECC 0                                   /*!< (unspecified)                                                        */
#define RAMC_SEC 1                                   /*!< (unspecified)                                                        */

#define RAMC122_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC122_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC123_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC123_SEC 0                                /*!< (unspecified)                                                        */

/*PCGCSlave*/
#define PCGCSLAVE_PRESENT 1
#define PCGCSLAVE_COUNT 3

#define PCGCS000_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS000_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS000_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS000_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS000_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS010_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS010_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS010_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS010_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS010_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCSBUS_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 4

#define HSFLL_DITHER_32B 1                           /*!< (unspecified)                                                        */
#define HSFLL_CLOCKCTRL_MULT_RESET 4                 /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL_CLOCKCTRL_INTEGER_DIVISION 0           /*!< (unspecified)                                                        */

#define HSFLL300_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL300_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL300_CLOCKCTRL_INTEGER_DIVISION 0        /*!< (unspecified)                                                        */

#define HSFLL122_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL122_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL122_CLOCKCTRL_INTEGER_DIVISION 1        /*!< (unspecified)                                                        */

#define HSFLL121_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL121_CLOCKCTRL_MULT_RESET 4              /*!< Reset value of register CLOCKCTRL.MULT: clockctrl_mult_reset         */
#define HSFLL121_CLOCKCTRL_INTEGER_DIVISION 0        /*!< (unspecified)                                                        */

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 5

#define LRCCONF000_POWERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN 0                          /*!< (unspecified)                                                        */
#define LRCCONF000_SYSTEMOFF 0                       /*!< (unspecified)                                                        */
#define LRCCONF000_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF000_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF000_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_MAX 7                      /*!< (unspecified)                                                        */
#define LRCCONF000_NACTPD_SIZE 8                     /*!< (unspecified)                                                        */
#define LRCCONF000_PDACT 0                           /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF000_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF000_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF000_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF000_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF000_POWERON_MAIN_RESET 0              /*!< (unspecified)                                                        */
#define LRCCONF000_POWERON_ACT_RESET 0               /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN_MAIN_RESET 1               /*!< (unspecified)                                                        */
#define LRCCONF000_RETAIN_ACT_RESET 1                /*!< (unspecified)                                                        */

#define LRCCONF010_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF010_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF010_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF010_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF010_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF010_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF010_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF010_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF010_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF010_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF010_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF010_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF010_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF010_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF010_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF010_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF300_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF300_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF300_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF300_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MAX 7                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_SIZE 8                       /*!< (unspecified)                                                        */
#define LRCCONF300_CLKCTRL 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF300_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF300_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF300_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF300_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF300_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF300_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF300_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF310_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF310_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF310_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF310_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF310_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF310_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF310_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF310_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF310_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF_SDCARD_POWERON 1                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_RETAIN 1                      /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_SYSTEMOFF 1                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_LRCREQHFXO 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MAX 7                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_SIZE 8                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_CLKCTRL 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MIN 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MAX 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_SIZE 1                 /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_PDACT 1                       /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MIN 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MAX 7                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_SIZE 8                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_OTHERON 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MIN 0                /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MAX 15               /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_SIZE 16              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_AX2XWAITSTATES 0              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_POWERON_MAIN_RESET 0          /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF_SDCARD_POWERON_ACT_RESET 0           /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF_SDCARD_RETAIN_MAIN_RESET 1           /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF_SDCARD_RETAIN_ACT_RESET 1            /*!< Reset value of register RETAIN.ACT: 1                                */

/*PCGC Master*/
#define PCGCMASTER_PRESENT 1
#define PCGCMASTER_COUNT 4

#define PCGCM000_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM000_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM000_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM000_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM010_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM010_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM010_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM010_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM300_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM300_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM300_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM300_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

