ankuns/nrfx/bsp/stable/mdk/nrf7140_application_peripherals.h
#define PDM130_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM130_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM130_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM130_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM130_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM131_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM131_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM131_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM131_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM131_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM132_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM132_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM132_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM132_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM132_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PDM133_EASYDMA5 0                            /*!< (unspecified)                                                        */
#define PDM133_EASYDMATEMP 1                         /*!< (unspecified)                                                        */
#define PDM133_SAMPLE16 0                            /*!< (unspecified)                                                        */
#define PDM133_SAMPLE48 1                            /*!< (unspecified)                                                        */
#define PDM133_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM133_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PDM133_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PDM133_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PDM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PDM133_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

/* ============================================= SPU010 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU010.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_0  = 0,    /*!< Index of access permissions for channel 0 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_1  = 1,    /*!< Index of access permissions for channel 1 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_2  = 2,    /*!< Index of access permissions for channel 2 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_3  = 3,    /*!< Index of access permissions for channel 3 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_INTERRUPT_0 = 24, /*!< Index of access permissions for interrupt 0 of IPCT              */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_INTERRUPT_1 = 25, /*!< Index of access permissions for interrupt 1 of IPCT              */
} NRF_APPLICATION_SPU010_FEATURES_ENUM_t;


#ifdef __cplusplus
}
#endif
#endif /* NRF7140_APPLICATION_PERIPHERALS_H */

